print("Привіт! Вітаю у грі 'Вікторина'.")
print("Тобі буде поставлено кілька запитань. Введи відповідь та отримуй бали!")
print("Відповідай точно! Почнімо.\n")

score = 0

q11 = input("1. Яка столиця України? ")
if q11 == "київ":
    print("Правильно!!!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Київ\n")

q21 = input("2. Скільки буде 5 + 7? ")
if q21 == "12":
    print("Правильно!!!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: 12\n")

q22 = input("3. Яка планета найближча до Сонця? ")
if q22 == "меркурій":
    print("Правильно!!!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Меркурій\n")

q23 = input("4. Що таке інерція? ")
if q23 == "Здатність тіла зберігати стан спокою або рівномірного руху":
    print("правильно!!!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Меркурій\n")

    print(f"Гру завершено! Твій результат: {score} з 4 правильних відповідей.")