print('Привіт! Це гра-вікторина. У тебе є на вибір 1 темa : математика')
('Та 3 важкості: легка; середня; важка. ')
('Тобі будуть давати 1 варіанти відповіді на кожне запитання.')
this = input('Вибери тему. 1 - математика: ')
if this == '1' :
        q1 = input('Скільки буде 7 + 5? 1. 14; 2. 12; 3. 11: ')
        if q1 == '2' :
            print('Правильна відповідь.')
            points = 0
            points += 1
        else :
            print('Невірна відповідь')
        q2 = input('Скільки сторін має трикутник? 1. 2; 2. 3; 3. 1: ')
        if q2 == '3':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else :
            print('Невірна відповідь')
        q3 = input('Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
                    '; 3. Опір руху рідини: ')
        if q3 == '2':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else :
            print('Невірна відповідь')
        q4 = input('Який результат ділення 36 на 6? 1.5 ; 2. 6; '
                    '3. 8 ')
        if q4 == '2':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else:
            print('Невірна відповідь')
        q6 = input('Що таке число Пі приблизно? 1. 2.14; 2. 4.13; 3. 3.14: ')
        if q6 == '3':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else :
            print('Невірна відповідь')
        q7 = input('Який елемент ДНК відповідає за передачу спадкової інформації? 1. Гемоглобін; 2. Гени; 3.Хромосоми: ')
        if q7 == '2':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else:
            print('Невірна відповідь')
        q8 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q8  == '3':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else:
            print('Невірна відповідь')
        q9 = input(
        'Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
        '; 3. Опір руху рідини: ')
        if q9 == '2':
            print('Правильна відповідь.')
            points = 0
            points += 1
        else:
            print('Невірна відповідь')
        q10 = input(
        'Яка тварина є ссавцем? 1. Акула ; 2.) Дельфін; '
        '3. Лящ: ')
        if q10 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q11 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q11 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q12 = input('Яка фізична величина вимірюється в ньютонах? 1. маса; 2. сила; 3.) температура: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
print("я забув програму яка виводить кількість правильних відповідей!!!!!!!!!:(")